; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph1 - mode
	thermograph0 - mode
	infrared2 - mode
	infrared3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 103)
	(= (data Star5 thermograph1) 73)
	(= (data Star6 thermograph1) 72)
	(= (data Planet7 thermograph1) 180)
	(= (data Phenomenon8 thermograph1) 94)
	(= (data Star9 thermograph1) 42)
	(= (data Planet10 thermograph1) 170)
	(= (data Planet11 thermograph1) 170)
	(= (data Star12 thermograph1) 261)
	(= (data Star13 thermograph1) 103)
	(= (data Star14 thermograph1) 131)
	(= (data Star5 thermograph0) 33)
	(= (data Star6 thermograph0) 155)
	(= (data Planet7 thermograph0) 34)
	(= (data Phenomenon8 thermograph0) 32)
	(= (data Star9 thermograph0) 129)
	(= (data Planet10 thermograph0) 133)
	(= (data Planet11 thermograph0) 278)
	(= (data Star12 thermograph0) 153)
	(= (data Star13 thermograph0) 175)
	(= (data Star14 thermograph0) 295)
	(= (data Star5 infrared2) 284)
	(= (data Star6 infrared2) 111)
	(= (data Planet7 infrared2) 149)
	(= (data Phenomenon8 infrared2) 101)
	(= (data Star9 infrared2) 102)
	(= (data Planet10 infrared2) 131)
	(= (data Planet11 infrared2) 73)
	(= (data Star12 infrared2) 154)
	(= (data Star13 infrared2) 142)
	(= (data Star14 infrared2) 299)
	(= (data Star5 infrared3) 217)
	(= (data Star6 infrared3) 210)
	(= (data Planet7 infrared3) 149)
	(= (data Phenomenon8 infrared3) 262)
	(= (data Star9 infrared3) 88)
	(= (data Planet10 infrared3) 262)
	(= (data Planet11 infrared3) 108)
	(= (data Star12 infrared3) 285)
	(= (data Star13 infrared3) 39)
	(= (data Star14 infrared3) 99)
	(= (slew_time GroundStation1 GroundStation0) 13.04)
	(= (slew_time GroundStation0 GroundStation1) 13.04)
	(= (slew_time Star2 GroundStation0) 69.1)
	(= (slew_time GroundStation0 Star2) 69.1)
	(= (slew_time Star2 GroundStation1) 33.84)
	(= (slew_time GroundStation1 Star2) 33.84)
	(= (slew_time GroundStation3 GroundStation0) 0.7144)
	(= (slew_time GroundStation0 GroundStation3) 0.7144)
	(= (slew_time GroundStation3 GroundStation1) 12.75)
	(= (slew_time GroundStation1 GroundStation3) 12.75)
	(= (slew_time GroundStation3 Star2) 62.13)
	(= (slew_time Star2 GroundStation3) 62.13)
	(= (slew_time Star4 GroundStation0) 55.07)
	(= (slew_time GroundStation0 Star4) 55.07)
	(= (slew_time Star4 GroundStation1) 75.42)
	(= (slew_time GroundStation1 Star4) 75.42)
	(= (slew_time Star4 Star2) 52.34)
	(= (slew_time Star2 Star4) 52.34)
	(= (slew_time Star4 GroundStation3) 17.53)
	(= (slew_time GroundStation3 Star4) 17.53)
	(= (slew_time Star5 GroundStation0) 47.07)
	(= (slew_time GroundStation0 Star5) 47.07)
	(= (slew_time Star5 GroundStation1) 49.51)
	(= (slew_time GroundStation1 Star5) 49.51)
	(= (slew_time Star5 Star2) 7.487)
	(= (slew_time Star2 Star5) 7.487)
	(= (slew_time Star5 GroundStation3) 75.47)
	(= (slew_time GroundStation3 Star5) 75.47)
	(= (slew_time Star5 Star4) 22.82)
	(= (slew_time Star4 Star5) 22.82)
	(= (slew_time Star6 GroundStation0) 0.4709)
	(= (slew_time GroundStation0 Star6) 0.4709)
	(= (slew_time Star6 GroundStation1) 31.81)
	(= (slew_time GroundStation1 Star6) 31.81)
	(= (slew_time Star6 Star2) 60.2)
	(= (slew_time Star2 Star6) 60.2)
	(= (slew_time Star6 GroundStation3) 44.58)
	(= (slew_time GroundStation3 Star6) 44.58)
	(= (slew_time Star6 Star4) 27.11)
	(= (slew_time Star4 Star6) 27.11)
	(= (slew_time Star6 Star5) 57.09)
	(= (slew_time Star5 Star6) 57.09)
	(= (slew_time Planet7 GroundStation0) 18.47)
	(= (slew_time GroundStation0 Planet7) 18.47)
	(= (slew_time Planet7 GroundStation1) 16.27)
	(= (slew_time GroundStation1 Planet7) 16.27)
	(= (slew_time Planet7 Star2) 1.136)
	(= (slew_time Star2 Planet7) 1.136)
	(= (slew_time Planet7 GroundStation3) 43.82)
	(= (slew_time GroundStation3 Planet7) 43.82)
	(= (slew_time Planet7 Star4) 24.02)
	(= (slew_time Star4 Planet7) 24.02)
	(= (slew_time Planet7 Star5) 15.02)
	(= (slew_time Star5 Planet7) 15.02)
	(= (slew_time Planet7 Star6) 48.85)
	(= (slew_time Star6 Planet7) 48.85)
	(= (slew_time Phenomenon8 GroundStation0) 18.85)
	(= (slew_time GroundStation0 Phenomenon8) 18.85)
	(= (slew_time Phenomenon8 GroundStation1) 15.74)
	(= (slew_time GroundStation1 Phenomenon8) 15.74)
	(= (slew_time Phenomenon8 Star2) 96.61)
	(= (slew_time Star2 Phenomenon8) 96.61)
	(= (slew_time Phenomenon8 GroundStation3) 47.81)
	(= (slew_time GroundStation3 Phenomenon8) 47.81)
	(= (slew_time Phenomenon8 Star4) 64.19)
	(= (slew_time Star4 Phenomenon8) 64.19)
	(= (slew_time Phenomenon8 Star5) 59.93)
	(= (slew_time Star5 Phenomenon8) 59.93)
	(= (slew_time Phenomenon8 Star6) 63.79)
	(= (slew_time Star6 Phenomenon8) 63.79)
	(= (slew_time Phenomenon8 Planet7) 26.95)
	(= (slew_time Planet7 Phenomenon8) 26.95)
	(= (slew_time Star9 GroundStation0) 11.46)
	(= (slew_time GroundStation0 Star9) 11.46)
	(= (slew_time Star9 GroundStation1) 16.88)
	(= (slew_time GroundStation1 Star9) 16.88)
	(= (slew_time Star9 Star2) 6.311)
	(= (slew_time Star2 Star9) 6.311)
	(= (slew_time Star9 GroundStation3) 34.2)
	(= (slew_time GroundStation3 Star9) 34.2)
	(= (slew_time Star9 Star4) 43.23)
	(= (slew_time Star4 Star9) 43.23)
	(= (slew_time Star9 Star5) 64.43)
	(= (slew_time Star5 Star9) 64.43)
	(= (slew_time Star9 Star6) 69.59)
	(= (slew_time Star6 Star9) 69.59)
	(= (slew_time Star9 Planet7) 83.13)
	(= (slew_time Planet7 Star9) 83.13)
	(= (slew_time Star9 Phenomenon8) 12.72)
	(= (slew_time Phenomenon8 Star9) 12.72)
	(= (slew_time Planet10 GroundStation0) 9.256)
	(= (slew_time GroundStation0 Planet10) 9.256)
	(= (slew_time Planet10 GroundStation1) 27)
	(= (slew_time GroundStation1 Planet10) 27)
	(= (slew_time Planet10 Star2) 39.84)
	(= (slew_time Star2 Planet10) 39.84)
	(= (slew_time Planet10 GroundStation3) 61.17)
	(= (slew_time GroundStation3 Planet10) 61.17)
	(= (slew_time Planet10 Star4) 1.454)
	(= (slew_time Star4 Planet10) 1.454)
	(= (slew_time Planet10 Star5) 6.143)
	(= (slew_time Star5 Planet10) 6.143)
	(= (slew_time Planet10 Star6) 7.35)
	(= (slew_time Star6 Planet10) 7.35)
	(= (slew_time Planet10 Planet7) 54.11)
	(= (slew_time Planet7 Planet10) 54.11)
	(= (slew_time Planet10 Phenomenon8) 83.72)
	(= (slew_time Phenomenon8 Planet10) 83.72)
	(= (slew_time Planet10 Star9) 73.7)
	(= (slew_time Star9 Planet10) 73.7)
	(= (slew_time Planet11 GroundStation0) 7.087)
	(= (slew_time GroundStation0 Planet11) 7.087)
	(= (slew_time Planet11 GroundStation1) 7.678)
	(= (slew_time GroundStation1 Planet11) 7.678)
	(= (slew_time Planet11 Star2) 54.55)
	(= (slew_time Star2 Planet11) 54.55)
	(= (slew_time Planet11 GroundStation3) 42.46)
	(= (slew_time GroundStation3 Planet11) 42.46)
	(= (slew_time Planet11 Star4) 26.86)
	(= (slew_time Star4 Planet11) 26.86)
	(= (slew_time Planet11 Star5) 17.36)
	(= (slew_time Star5 Planet11) 17.36)
	(= (slew_time Planet11 Star6) 71.12)
	(= (slew_time Star6 Planet11) 71.12)
	(= (slew_time Planet11 Planet7) 36.04)
	(= (slew_time Planet7 Planet11) 36.04)
	(= (slew_time Planet11 Phenomenon8) 86.41)
	(= (slew_time Phenomenon8 Planet11) 86.41)
	(= (slew_time Planet11 Star9) 20.85)
	(= (slew_time Star9 Planet11) 20.85)
	(= (slew_time Planet11 Planet10) 2.598)
	(= (slew_time Planet10 Planet11) 2.598)
	(= (slew_time Star12 GroundStation0) 50.66)
	(= (slew_time GroundStation0 Star12) 50.66)
	(= (slew_time Star12 GroundStation1) 46.76)
	(= (slew_time GroundStation1 Star12) 46.76)
	(= (slew_time Star12 Star2) 16.65)
	(= (slew_time Star2 Star12) 16.65)
	(= (slew_time Star12 GroundStation3) 6.987)
	(= (slew_time GroundStation3 Star12) 6.987)
	(= (slew_time Star12 Star4) 4.291)
	(= (slew_time Star4 Star12) 4.291)
	(= (slew_time Star12 Star5) 37.26)
	(= (slew_time Star5 Star12) 37.26)
	(= (slew_time Star12 Star6) 37.84)
	(= (slew_time Star6 Star12) 37.84)
	(= (slew_time Star12 Planet7) 63.44)
	(= (slew_time Planet7 Star12) 63.44)
	(= (slew_time Star12 Phenomenon8) 2.373)
	(= (slew_time Phenomenon8 Star12) 2.373)
	(= (slew_time Star12 Star9) 55.8)
	(= (slew_time Star9 Star12) 55.8)
	(= (slew_time Star12 Planet10) 25.66)
	(= (slew_time Planet10 Star12) 25.66)
	(= (slew_time Star12 Planet11) 13.02)
	(= (slew_time Planet11 Star12) 13.02)
	(= (slew_time Star13 GroundStation0) 16.97)
	(= (slew_time GroundStation0 Star13) 16.97)
	(= (slew_time Star13 GroundStation1) 45.11)
	(= (slew_time GroundStation1 Star13) 45.11)
	(= (slew_time Star13 Star2) 8.461)
	(= (slew_time Star2 Star13) 8.461)
	(= (slew_time Star13 GroundStation3) 58.79)
	(= (slew_time GroundStation3 Star13) 58.79)
	(= (slew_time Star13 Star4) 4.277)
	(= (slew_time Star4 Star13) 4.277)
	(= (slew_time Star13 Star5) 0.3122)
	(= (slew_time Star5 Star13) 0.3122)
	(= (slew_time Star13 Star6) 55.39)
	(= (slew_time Star6 Star13) 55.39)
	(= (slew_time Star13 Planet7) 16)
	(= (slew_time Planet7 Star13) 16)
	(= (slew_time Star13 Phenomenon8) 59.84)
	(= (slew_time Phenomenon8 Star13) 59.84)
	(= (slew_time Star13 Star9) 28.5)
	(= (slew_time Star9 Star13) 28.5)
	(= (slew_time Star13 Planet10) 74.99)
	(= (slew_time Planet10 Star13) 74.99)
	(= (slew_time Star13 Planet11) 13.27)
	(= (slew_time Planet11 Star13) 13.27)
	(= (slew_time Star13 Star12) 53.07)
	(= (slew_time Star12 Star13) 53.07)
	(= (slew_time Star14 GroundStation0) 12.67)
	(= (slew_time GroundStation0 Star14) 12.67)
	(= (slew_time Star14 GroundStation1) 59.2)
	(= (slew_time GroundStation1 Star14) 59.2)
	(= (slew_time Star14 Star2) 44.54)
	(= (slew_time Star2 Star14) 44.54)
	(= (slew_time Star14 GroundStation3) 7.011)
	(= (slew_time GroundStation3 Star14) 7.011)
	(= (slew_time Star14 Star4) 5.593)
	(= (slew_time Star4 Star14) 5.593)
	(= (slew_time Star14 Star5) 18.28)
	(= (slew_time Star5 Star14) 18.28)
	(= (slew_time Star14 Star6) 1.401)
	(= (slew_time Star6 Star14) 1.401)
	(= (slew_time Star14 Planet7) 6.61)
	(= (slew_time Planet7 Star14) 6.61)
	(= (slew_time Star14 Phenomenon8) 27.08)
	(= (slew_time Phenomenon8 Star14) 27.08)
	(= (slew_time Star14 Star9) 42.59)
	(= (slew_time Star9 Star14) 42.59)
	(= (slew_time Star14 Planet10) 85.12)
	(= (slew_time Planet10 Star14) 85.12)
	(= (slew_time Star14 Planet11) 6.094)
	(= (slew_time Planet11 Star14) 6.094)
	(= (slew_time Star14 Star12) 0.3298)
	(= (slew_time Star12 Star14) 0.3298)
	(= (slew_time Star14 Star13) 22.47)
	(= (slew_time Star13 Star14) 22.47)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Phenomenon8 infrared3)
	(have_image Star9 infrared2)
	(have_image Planet10 infrared2)
	(have_image Star14 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 103 to 50.66, (fuel-used) from 0 to 52.34
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 star12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star12)
   changed: (fuel satellite0) from 50.66 to 46.369, (fuel-used) from 52.34 to 56.631
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 46.369 to 43.996, (fuel-used) from 56.631 to 59.004
   goals met: 0 of 5
6. (take_image satellite0 phenomenon8 instrument0 infrared3)
   added: (have_image phenomenon8 infrared3)
   changed: (data_capacity satellite0) from 1000 to 738, (data-stored) from 0 to 262
   goals met: 1 of 5
7. (turn_to satellite0 star12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star12)
   changed: (fuel satellite0) from 43.996 to 41.623, (fuel-used) from 59.004 to 61.377
   goals met: 1 of 5
8. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   changed: (fuel satellite0) from 41.623 to 41.2932, (fuel-used) from 61.377 to 61.7068
   goals met: 1 of 5
9. (turn_to satellite0 star12 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star12)
   changed: (fuel satellite0) from 41.2932 to 40.9634, (fuel-used) from 61.7068 to 62.0366
   goals met: 1 of 5
10. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   changed: (fuel satellite0) from 40.9634 to 40.6336, (fuel-used) from 62.0366 to 62.3664
   goals met: 1 of 5
11. (turn_to satellite0 star12 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star12)
   changed: (fuel satellite0) from 40.6336 to 40.3038, (fuel-used) from 62.3664 to 62.6962
   goals met: 1 of 5
12. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   changed: (fuel satellite0) from 40.3038 to 39.974, (fuel-used) from 62.6962 to 63.026
   goals met: 1 of 5
13. (take_image satellite0 star14 instrument0 infrared2)
   added: (have_image star14 infrared2)
   changed: (data_capacity satellite0) from 738 to 439, (data-stored) from 262 to 561
   goals met: 2 of 5
14. (turn_to satellite0 star12 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star12)
   changed: (fuel satellite0) from 39.974 to 39.6442, (fuel-used) from 63.026 to 63.3558
   goals met: 2 of 5
15. (turn_to satellite0 star4 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 39.6442 to 35.3532, (fuel-used) from 63.3558 to 67.6468
   goals met: 2 of 5
16. (turn_to satellite0 planet10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 35.3532 to 33.8992, (fuel-used) from 67.6468 to 69.1008
   goals met: 2 of 5
17. (take_image satellite0 planet10 instrument0 infrared2)
   added: (have_image planet10 infrared2)
   changed: (data_capacity satellite0) from 439 to 308, (data-stored) from 561 to 692
   goals met: 3 of 5
18. (turn_to satellite0 star5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 33.8992 to 27.7562, (fuel-used) from 69.1008 to 75.2438
   goals met: 4 of 5
19. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 27.7562 to 20.2692, (fuel-used) from 75.2438 to 82.7308
   goals met: 3 of 5
20. (turn_to satellite0 star9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 20.2692 to 13.9582, (fuel-used) from 82.7308 to 89.0418
   goals met: 3 of 5
21. (take_image satellite0 star9 instrument0 infrared2)
   added: (have_image star9 infrared2)
   changed: (data_capacity satellite0) from 308 to 206, (data-stored) from 692 to 794
   goals met: 4 of 5
22. (turn_to satellite0 star2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 13.9582 to 7.6472, (fuel-used) from 89.0418 to 95.3528
   goals met: 4 of 5
23. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 7.6472 to 0.1602, (fuel-used) from 95.3528 to 102.84
   goals met: 5 of 5
